backend/controllers/SiteController.php

SELECT COUNT(*) FROM `users`
SELECT COUNT(*) FROM `penduduk`
SELECT COUNT(*) FROM `request_pembangunan`
SELECT COUNT(*) FROM `lapor_aduan`
SELECT COUNT(*) FROM `pembangunan`
SELECT COUNT(*) FROM `dusun`
SELECT COUNT(*) FROM `rt_rw`
SELECT * FROM `mitra`
SELECT * FROM `kategori_pembangunan`
SELECT * FROM `sumber_dana_pembangunan`
SELECT * FROM `pembangunan` LIMIT 5
SELECT COUNT(*) FROM `pembangunan` WHERE `kategori_pembangunan_id`=1
---
    public function actionIndex()
    {
        if (!parent::isLogin()) {
            return $this->redirect(Url::toRoute('site/login'));
        }

        $user=User::find()->count();
        $penduduk=Penduduk::find()->count();
        $request=RequestPembangunan::find()->count();
        $lapor=LaporAduan::find()->count();
        $pembangunan=Pembangunan::find()->count();
        $dusun=Dusun::find()->count();
        $rtrw=Rtrw::find()->count();
        $mitraOption = [0 => '- Cari Data -'];
        $mitra = Mitra::find()->all();
        foreach ($mitra as $item) {
            $mitraOption[$item->id] = $item->nama_mitra;
        }
        $kategoriOption = [0 => '- Cari Data -'];
        $kategori = KategoriPembangunan::find()->all();
        foreach ($kategori as $item) {
            $kategoriOption[$item->id] = $item->nama;
        }
        $sumberOption = [0 => '- Cari Data -'];
        $sumber= SumberDanaPembangunan::find()->all();
        foreach ($sumber as $item) {
            $sumberOption[$item->id] = $item->nama;
        }

        $pembangunanTerbaru=Pembangunan::find()->limit(5)->all();

        $pembangunanAll=KategoriPembangunan::find()->all();
        $dataCount=[];
        foreach ($pembangunanAll as $item){
            $kategoriAll=Pembangunan::find()->where(['kategori_pembangunan_id'=>$item->id])->count();

SELECT * FROM `pembangunan`
SELECT SUM(capaian_progress) FROM `lapor_progress` WHERE `pembangunan_id`=1
---
        }


        $dataPembangunan=Pembangunan::find()->all();
            foreach ($dataPembangunan as $item){
                $laporCount=LaporProgress::find()->where(['pembangunan_id'=>$item->id])
                    ->sum('capaian_progress');

SELECT * FROM `users` WHERE `username`='admin'
SELECT * FROM `users` WHERE `password`='dd94709528bb1c83d08f3088d4043f4742891f4f'
SELECT * FROM `users` WHERE (`username`='admin') AND (`password`='dd94709528bb1c83d08f3088d4043f4742891f4f')
UPDATE `users` SET `last_login`='2018-01-14 16:47:47' WHERE `id`=1
---
    public function actionValidateLogin()
    {
        $username = Yii::$app->request->post('username', '');
        $password = sha1(Yii::$app->request->post('password', ''));
        $cekUsername=User::findOne(['username'=>$username]);
        $cekPassword=User::findOne(['password'=>$password]);
        $data = User::findOne(['username' => $username, 'password' => $password]);

        if(is_null($cekUsername)){
            return "
            <div class='alert alert-danger'>Username Salah!</div>";
        }

        if(is_null($cekPassword)){
            return "
            <div class='alert alert-danger'>Password Salah!</div>";
        }
        if(strlen($password)<8){
            return "
            <div class='alert alert-warning'>Password Kurang dari 8 Karakter!</div>";
        }
        $data->last_login = date('Y-m-d H:i:s');
        $data->save();