backend/runtime/Smarty/compile/428bd98f7415e152ceca94dfcbd0737059c5bfcd_0.file.main.tpl.php

                    <li class="dropdown messages-menu">
                        <a href="#" class="dropdown-toggle" data-toggle="dropdown">
                            <i class="fa fa-envelope-o"></i>
                            <span class="label label-success"><?php echo backend\models\RequestPembangunan::find()->where(array('status'=>'requestbaru'))->count();?>
</span>
                        </a>
                        <ul class="dropdown-menu">
                            <li class="header">Anda Memiliki <?php echo backend\models\RequestPembangunan::find()->where(array('status'=>'requestbaru'))->count();?>
---
SELECT COUNT(*) FROM `request_pembangunan` WHERE `status`='requestbaru'

                    <li class="dropdown notifications-menu">
                        <a href="#" class="dropdown-toggle" data-toggle="dropdown">
                            <i class="fa fa-bell-o"></i>
                            <span class="label label-warning"><?php echo backend\models\LaporAduan::find()->where(array('status'=>'laporanbaru'))->count();?>
---
SELECT COUNT(*) FROM `lapor_aduan` WHERE `status`='laporanbaru'

                        </a>
                        <ul class="dropdown-menu">

                            <li class="header">Anda Memiliki <?php echo backend\models\LaporAduan::find()->where(array('status'=>'laporanbaru'))->count();?>
---
SELECT COUNT(*) FROM `lapor_aduan` WHERE `status`='laporanbaru'