backend/runtime/Smarty/compile/4eb48adf2c2c9a16f314d5d6fd9ccba97256a0ed_0.file.index.tpl.php

SELECT * FROM `mitra` WHERE `id`=1
---
</td>
                            <td><?php echo $_smarty_tpl->tpl_vars['item']->value->tgl_selesai;?>
</td>
                            <td><?php echo $_smarty_tpl->tpl_vars['item']->value->mitra->nama_mitra;?>