backend/runtime/Smarty/compile/5a2cdd9a56e797ff6f1b337b98af8a846636aed8_0.file.index.tpl.php

function content_5df770f407d974_63491791 (Smarty_Internal_Template $_smarty_tpl) {
echo $_smarty_tpl->smarty->registered_plugins[Smarty::PLUGIN_FUNCTION]['set'][0][0]->functionSet(array('title'=>"Data Laporan Aduan Masyarakat"),$_smarty_tpl);?>

<?php $_smarty_tpl->_assignInScope('user', Yii::$app->session->get('user',false));
?>
<table id="user-table" class="table table-bordered table-striped">
    <thead>
    <tr>
        <th>No</th>
        <th>Nama Pembangunan</th>
        <th>Tanggal Aduan</th>
        <th>Pelapor</th>
        <th>Status</th>
        <th>Opsi</th>
    </tr>
    </thead>
    <tbody>
    <?php $_smarty_tpl->_assignInScope('nomor', 1);
?>
    <?php
$_from = $_smarty_tpl->smarty->ext->_foreach->init($_smarty_tpl, $_smarty_tpl->tpl_vars['data']->value, 'item');
if ($_from !== null) {
foreach ($_from as $_smarty_tpl->tpl_vars['item']->value) {
?>
        <tr>
            <td><?php echo $_smarty_tpl->tpl_vars['nomor']->value++;?>
</td>
            <td><?php echo $_smarty_tpl->tpl_vars['item']->value->pembangunan->nama_pembangunan;?>
</td>
            <td><?php echo $_smarty_tpl->tpl_vars['item']->value->pembangunan->tgl_mulai;?>
</td>
            <td><?php echo $_smarty_tpl->tpl_vars['item']->value->user->username;?>
---
SELECT * FROM `pembangunan` WHERE `id`=1
SELECT * FROM `users` WHERE `id`=11