backend/controllers/master/StatusPembangunanController.php

SELECT * FROM `status_pembangunan`
---
    public function  actionIndex(){
        if(!parent::isLogin()){
            return $this->redirect(Url::toRoute('site/login'));
        }

        $data = StatusPembangunan::find()->all();