backend/controllers/operator/KategoriPembangunanController.php

SELECT * FROM `kategori_pembangunan`
---
    public function  actionIndex(){
        if(!parent::isLogin()){
            return $this->redirect(Url::toRoute('site/login'));
        }

        $data = KategoriPembangunan::find()->all();