backend/controllers/operator/LaporAduanController.php

    public function actionIndex(){
        if(!parent::isLogin()){
            return $this->redirect(Url::toRoute('site/login'));
        }
        $params['data']=LaporAduan::find()->all();
---
SELECT * FROM `lapor_aduan`