backend/controllers/operator/PembangunanController.php

SELECT * FROM `pembangunan`
---
    public function  actionIndex()
    {
        if (!parent::isLogin()) {
            return $this->redirect(Url::toRoute('site/login'));
        }


        $data = Pembangunan::find()->all();

SELECT * FROM `sumber_dana_pembangunan`
SELECT * FROM `kategori_pembangunan`
SELECT * FROM `status_pembangunan`
SELECT * FROM `mitra`
---
    public function actionForm(){
        $id=Yii::$app->request->post('id',0);
        if($id){
            $data=Pembangunan::findOne($id);
        }else{
            $data=new Pembangunan();
        }
        $sumberOption=[];
        $sumber=SumberDanaPembangunan::find()->all();
        foreach($sumber as $item){
            $sumberOption[$item->id]=$item->nama;
        }
        $kategoriOption=[];
        $kategori=KategoriPembangunan::find()->all();
        foreach ($kategori as $item){
            $kategoriOption[$item->id]=$item->nama;
        }
        $statusOption=[];
        $status=StatusPembangunan::find()->all();
        foreach ($status as $item){
            $statusOption[$item->id]=$item->nama;
        }
        $mitraOption=[];
        $mitra=Mitra::find()->all();