backend/controllers/operator/PendudukController.php

SELECT * FROM `penduduk`
---
    public function  actionIndex()
    {
        if (!parent::isLogin()) {
            return $this->redirect(Url::toRoute('site/login'));
        }


        $data = Penduduk::find()->all();