backend/controllers/operator/RequestPembangunanController.php

SELECT * FROM `request_pembangunan`
---
    public function actionIndex(){
        if(!parent::isLogin()){
            return $this->redirect(Url::toRoute('site/login'));
        }
        $params['data']=RequestPembangunan::find()->all();