api/modules/v1/controllers/AuthController.php

	public function actionLogin()
	{
	    $loginInfo = new LoginInfo();
        $username = Yii::$app->request->post('username', '');
        $password = sha1(Yii::$app->request->post('password', ''));
        $data = User::findOne(['username' => $username, 'password' => $password]);
---
SELECT * FROM `users` WHERE (`username`='nanda') AND (`password`='ca57ac9ddce4c2a4923f92e003e6d2883043adfe')