api/modules/v1/controllers/KategoriPembangunanController.php

    public function actionGetKategoriPembangunan(){

        $data=KategoriPembangunan::find()->all();
---
SELECT * FROM `kategori_pembangunan`