api/modules/v1/controllers/LaporAduanController.php

SELECT * FROM `users` WHERE `access_token`='bmFuZGE='
INSERT INTO `lapor_aduan` (`deskripsi`, `foto`, `pembangunan_id`, `users_id`, `status`) VALUES ('test', '0', 1, 3, 'laporanbaru')
---
    public function actionCreate(){
        $headers=Yii::$app->request->headers;
        $auth=$headers->get('authorization');
        $authCek=explode(' ', $auth);
        $token=$authCek[1];
        $user=User::find()->where(['access_token'=>$token])->one();
        $data= new LaporAduan();
        $data->deskripsi=Yii::$app->request->post('deskripsi','');
        $pembangunanId=intval(Yii::$app->request->post('pembangunan_id',''));
	   $data->foto='0';
        if(is_null($pembangunanId)){
            return[
                'status'=>false,
                'message'=>'Pembangunan yang dipilih tidak valid !!'
            ];
        }
        $data->pembangunan_id=$pembangunanId;
        $data->users_id=$user->id;
        $data->status='laporanbaru';
        //var_dump($data->save());
	 try{
                $data->save();