api/modules/v1/controllers/PembangunanController.php

SELECT * FROM `pembangunan`
SELECT SUM(capaian_progress) FROM `lapor_progress` WHERE `pembangunan_id`=1
---
    public function actionIndex(){
        $data=Pembangunan::find()->all();
        if ($data) {
            foreach ($data as $item){
                $lapor=LaporProgress::find()->where(['pembangunan_id'=>$item->id])
                    ->sum('capaian_progress');

SELECT * FROM `pembangunan`
---
    public function actionGetPembangunan(){

        $pembangunan=Pembangunan::find()->all();