api/modules/v1/controllers/PengumumanController.php

SELECT * FROM `pengumuman` GROUP BY `tgl_pengumuman`
---
    public function actionGetPengumuman(){

        $data=Pengumuman::find()->groupBy('tgl_pengumuman')->all();