api/modules/v1/controllers/ProfileController.php

    public function actionGetProfile()
    {
        $headers = Yii::$app->request->headers;
        $auth = $headers->get('authorization');
        $authCek = explode(' ', $auth);
        $token = $authCek[1];
        $user = User::find()->where(['access_token' => $token])->one();
---
SELECT * FROM `users` WHERE `access_token`='bmFuZGE='