api/modules/v1/controllers/RequestPembangunanController.php

    public function actionCreate(){
        $headers=Yii::$app->request->headers;
        $auth=$headers->get('authorization');
        $authCek=explode(' ', $auth);
        $token=$authCek[1];
        $user=User::find()->where(['access_token'=>$token])->one();
        $data= new RequestPembangunan();
        $data->judul=Yii::$app->request->post('judul','');
        $data->deskripsi=Yii::$app->request->post('deskripsi','');
        $data->users_id=$user->id;
        //test
        $data->status='requestbaru';
        $kategoriId=intval(Yii::$app->request->post('kategori_pembangunan_id',''));
		$data->kategori_pembangunan_id=$kategoriId;

		//var_dump($data);


		try{
		  $data->save();
---
SELECT * FROM `users` WHERE `access_token`='bmFuZGE='
INSERT INTO `request_pembangunan` (`judul`, `deskripsi`, `users_id`, `status`, `kategori_pembangunan_id`) VALUES ('lampu jalan RT 1', 'rt 1 sampe hari ini masih gelap', 11, 'requestbaru', 1)