backend/models/Role.php

    public static function findByName($name)
    {
        return Role::find()->where(['name'=>$name])->one();
---
SELECT * FROM `roles` WHERE `name`='admin'