backend/models/User.php

SELECT * FROM `roles` WHERE `id`=7
---
    public function memberOf($groupList)
    {
        $groupList = explode("|", $groupList);
        if(in_array($this->role->group->alias, $groupList)){

SELECT * FROM `users` WHERE `access_token`='bmFuZGE='
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['access_token' => $token]);